// task 4
"use strict"

let userValue = parseInt(prompt('Введите целое число от 0 до 15: '));

if (userValue >= 0 && userValue <= 15) {
    switch (userValue) {
        case 0:
            alert('Оставшиеся числа: 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15');
            break;
        case 1:
            alert('Оставшиеся числа: 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15');
            break;
        case 2:
            alert('Оставшиеся числа: 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15');
            break;
        case 3:
            alert('Оставшиеся числа: 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15');
            break;
        case 4:
            alert('Оставшиеся числа: 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15');
            break;
        case 5:
            alert('Оставшиеся числа: 6, 7, 8, 9, 10, 11, 12, 13, 14, 15');
            break;
        case 6:
            alert('Оставшиеся числа: 7, 8, 9, 10, 11, 12, 13, 14, 15');
            break;
        case 7:
            alert('Оставшиеся числа: 8, 9, 10, 11, 12, 13, 14, 15');
            break;
        case 8:
            alert('Оставшиеся числа: 9, 10, 11, 12, 13, 14, 15');
            break;
        case 9:
            alert('Оставшиеся числа: 10, 11, 12, 13, 14, 15');
            break;
        case 10:
            alert('Оставшиеся числа: 11, 12, 13, 14, 15');
            break;
        case 11:
            alert('Оставшиеся числа: 12, 13, 14, 15');
            break;
        case 12:
            alert('Оставшиеся числа: 13, 14, 15');
            break;
        case 13:
            alert('Оставшиеся числа: 14, 15');
            break;
        case 14:
            alert('Оставшиеся числа: 15');
            break;
        case 15:
            alert('Оставшихся чисел нет, это было последним.');
            break;
    };
} else {
    alert('Вы ввели неправильное число!');
};